<template>
  <div class="treaty-container">
    <div class="treaty-tips">
      我接受<span @click="popupVisible = true">《MinerGlory算力租赁协议》</span>
    </div>
    <mt-popup class="pop-box" v-model="popupVisible">
      <div class="title">《超算服务器租用服务协议》</div>
      <div class="sub-title">第一条 合同项目与定义</div>
      <div class="content">
        超算服务器租用是指乙方租用甲方提供的数字超算服务器，该服务器置于甲方机房网络环境，为数字网络提供信息超算服务。甲方负责该服务器的硬件基本配置、软件安装和服务器硬件故障的排除，乙方按照本合同的约定租用服务器的计算能力。
        除非明确注明，本合同所涉及的超算服务器算力租用以下统称“服务器”。
      </div>
      <div class="sub-title">第二条 双方的权利和义务</div>
      <div class="sub-title" style="font-size: 12px">甲方的权利和义务</div>
      <div class="content">
        1.
        保证乙方的数据和资料的安全，不得将这些数据和资料透露给任何第三人或自己利用或者许可他人使用；如乙方发现甲方透露数据和资料给第三人或自己利用或者许可他人使用，乙方将追究甲方的法律责任并由甲方承担因此给乙方造成的一切经济损失。<br />
        2.
        甲方负责服务器的维护及技术支持等，并采取必要措施使服务器不受病毒侵袭、不受外来物理破坏。<br />
        3.
        甲方定期对服务器进行监控，对服务器的进行日常维护和监控，以保证乙方信息服务器的正常运行。甲方为乙方的租用的服务器程序和数据库提供必要的技术支持。甲方每周对数据进行备份，甲方负责乙方租用主机信息平台系统安全可靠的运行，网管中心每周七天，每天24小时监测服务器，并进行数据备份。<br />
        4.
        甲方接受乙方受托进行数字货币委托交易，并代第三方平台收取乙方交易手续费。<br />
        5.
        甲方按合同收取乙方租金，按月向乙方收取服务器电费（或从挖出的币中扣除）。<br />
        6.
        甲方每个月有权对机房环境进行检查维护，并可能对乙方当日收益带来一定影响，甲方对此不承担任何责任。
      </div>
      <div class="sub-title" style="font-size: 12px">乙方的权利和义务</div>
      <div class="content">
        1. 乙方租用甲方提供的服务器进行数字货币挖矿为主的信息服务，同时乙方 委托
        / 不委托 甲方进行数字货币交易。<br />
        2.
        乙方承诺：已对数字货币及投资风险和收益有一定了解，乙方自愿承担租用服务器的租金。<br />
        3.
        乙方对租用服务器所引起的任何经济、政治、法律等责任负完全民事责任。乙方同意，如发生上述事件，与甲方没有任何关系，甲方也不应对此或对第三方承担任何责任或者义务。<br />
        4.
        乙方承认甲方向乙方提供的任何资料、软件、数据等的权利属于甲方，乙方无权复制、传播、转让、许可或提供他人使用这些资源，否则应承担相应的责任。<br />
        5. 乙方应按时向甲方交纳本合同约定的租金费用及电费。<br />
      </div>
      <div class="sub-title">第三条 服务内容、费用及支付方法</div>
      <div class="content">
        本合同所涉及的费用为乙方租赁甲方的超算服务器租用费为__服务器计算能力，期限为__个月
        ，__起始日从服务器挖矿开通之日起计算。<br />乙方需在合同签订三日内支付全款到甲方指定银行账户。甲方收到乙方款项后30日内为乙方开通服务器服务，随后甲方按照约定每周向乙方发放服务器挖矿收益。乙方按方式1）从产币中扣除
        2）单独打款到甲方指定账户 向甲方支付电费。
      </div>
      <div class="sub-title">第四条 合同期限</div>
      <div class="content">
        本合同有效期以乙方租金打款到账为准，至租赁期结束止。双方对本合同无异议。
      </div>
      <div class="sub-title">第五条 合同解除、终止及违约责任</div>
      <div class="content">
        本合同在下述情形下终止，双方互不负责，但终止方应书面通知另一方：<br />
        一方当事人主体资格消失，如破产。但进行重组、名称变更或者与第三方合并等不在此列。<br />
        一方严重违反本合同，另一方根据本合同的约定解除本合同。<br />
        因不可抗力而解除本合同或者双方当事人协商一致解除本合同的。<br />
        依法律法规规定的情形而终止。<br />
        本合同到期后，如果乙方没有按时支付续约款项，则双方认同本合同执行终止。甲方届时将关闭乙方租用的服务器。<br />
        由于一方不履行协议约定的义务，或严重违反本合同约定的义务，造成本合同无法履行或履行不必要时，视作违约方片面终止本合同，守约方除有权向违约方索赔外，并有权终止本合同。
      </div>
      <div class="sub-title">第六条 责任限制</div>
      <div class="content">
        甲方在进行服务器配置、维护时需要短时间中断服务，或者由于Internet上通路的阻塞造成乙方服务器访问速度下降，甲方矿场所在地电站检修，乙方均认同是正常情况，不属于甲方违约。鉴于计算机及互联网的特殊性，因黑客、病毒、电信部门技术调整等引起的事件，乙方亦认同不属于甲方违约。<br />
        在履行本合同时，甲方对因第三方的过错或者延误而给乙方或者其他第三方造成的损失不负责任。<br />
        甲方对通过乙方间接接受甲方服务的第三方的损失不负责任。<br />
        由于甲方过错造成乙方遭受损失的，甲方最高赔偿限额不超过乙方已向甲方支付的款项总额。
      </div>
      <div class="sub-title">第七条 争议解决</div>
      <div class="content">
        各方在履行本合同过程中发生的纠纷由各方友好协商，协商不成可依法向当地人民法院起诉。
      </div>
      <div class="sub-title">第八条 不可抗力</div>
      <div class="content">
        任何一方遇有不可抗力而全部或部分不能履行本合同或迟延履行本合同，应自不可抗力事件发生之日起五日内，将事件情况以书面形式通知另一方，并于事件发生之日起二十日内，向另一方提交导致其全部或部分不能履行或迟延履行的证明。<br />
        遭受不可抗力的一方应采取一切必要措施减少损失，并在事件消除后立即恢复本合同的履行，除非此等履行已不可能或者不必要。<br />
        本条所称“不可抗力”系指不能预见、不能避免或不能克服的客观事件，包括但不限于自然灾害如洪水、火灾、爆炸、雷电、地震和风暴等以及社会事件如战争、动乱、政府管制、国家政策的突然变动和罢工等。
      </div>
      <div class="sub-title">第九条 保密</div>
      <div class="content">
        任何一方对在本合同履行过程中以任何方式获知的另一方商业秘密或其他技术及经营信息均负有保密义务，不得向任何其他第三方透露或泄露，但中国现行法律、法规另有规定或经另一方书面同意的除外。
      </div>
      <div class="sub-title">第十条 权利保留</div>
      <div class="content">
        任何一方没有行使其权利或没有就对方的违约行为采取任何行动，不应被视为是对权利的放弃或对追究违约责任或义务的放弃。任何一方放弃针对对方的任何权利，或放弃追究对方的任何过失，不应视为对任何其他权利或追究任何其他过失的放弃。所有放弃应书面做出。
      </div>
      <div class="sub-title">第十一条 通知</div>
      <div class="content">
        本合同要求或允许的通知或通讯，甲方通知以甲方邮件、短信、微信、电话方式传递，乙方通知以正式告知甲方的方式为准，自被通知一方收到时起生效。
      </div>
      <div class="sub-title">第十二条 合同的解释、法律适用、生效条件及其他</div>
      <div class="content">
        本合同的解除、终止或者本合同有关条款的无效均不影响本合同关于合同的解释、违约责任、知识产权、法律适用、责任限制、补偿及争议解决的有关约定的效力。<br />
        在本合同有效期内，因甲方上市、被收购、与第三方合并、名称变更等事由，乙方同意甲方可以将其在本合同中的权利和/或义务转让给相应的甲方权利/义务的承受者，但甲方应保证乙方在本合同中的权益不会因此而受到不利影响。<br />
        （本页以下无正文，为签署部分）
      </div>
    </mt-popup>
  </div>
</template>
<script>
export default {
  name: "example",

  data() {
    return {
      popupVisible: false,
    };
  },

  created() {},

  mounted() {},

  methods: {},
};
</script>
<style scoped lang="scss">
.treaty-container {
  .treaty-tips {
    color: #7c8698;
    font-size: 12px;

    span {
      color: #0091ff;
    }
  }
}

.pop-box {
  width: 80%;
  padding: 25px;
  height: 500px;
  overflow: scroll;
  text-align: left;

  .title {
    font-size: 20px;
    margin-bottom: 20px;
    text-align: center;
  }

  .sub-title {
    font-size: 12px;
    color: #203152;
    margin-bottom: 10px;
  }

  .content {
    font-size: 12px;
    line-height: 16px;
    color: #7c8698;
    margin-bottom: 20px;
  }
}
</style>
