<template>
  <view class="treaty-container">
    <view class="treaty-tips">
      *使用即为同意
      <text class="link" @click="popup1Visible = true">《用户服务协议》</text>
      和
      <text class="link" @click="popup2Visible = true">《用户隐私条款》</text>
    </view>
    <u-popup v-model="popup1Visible" mode="center" border-radius="16" :mask-close-able="true">
      <scroll-view scroll-y class="pop-box">
        <view class="title">《用户服务协议》</view>
        <view class="content">
          <view class="sub-content">
            MinerGlory（www.minerglory.cn）系为用户提供数字资产超算服务器、数字资产超算服务算力、数字货币等数字资产（以下统一称为"数字资产"）交易和相关服务的信息中介服务平台（以下简称"平台"）。平台依据本协议（定义见下文）的规定为在平台进行注册的会员（以下简称"会员"）提供服务，本协议在会员和平台之间具有法律约束力。平台在此特别提醒用户认真阅读并充分理解本协议项下的各条款，特别是本协议中涉及免除或限制平台责任的条款，以及排除或限制用户权利的条款。用户应当审慎阅读，并选择接受或不接受本协议。除非用户接受本协议项下的所有条款，否则用户无权使用平台基于本协议所提供的服务。若用户不同意本协议的内容，或拒绝承认平台随时对本协议进行单方修改的权利，则用户应当立即停止使用并不再访问本平台。用户一经注册成为会员或使用平台服务即视为对本协议全部条款（包括本公司对本协议随时做出的任何修改）充分理解并完全接受。
            为了本协议表述之方便，本平台在本协议中合称使用"我们"或其他第一人称称呼；访问平台的自然人或其他主体均称为"您"或其他第二人称；我们和您在本协议中合称为"双方"，我们或您称为"一方"。
          </view>
          <view class="sub-title">第一章 定义和解释</view>
          <view class="sub-content">
            第一条在本协议中，除非本协议项下条款另有约定，以下词汇或者表述应当具有下述意义：<br />
            (一)本协议
            应当包括本服务协议、隐私条款、反洗钱指引以及其他在平台上已经发布或将来可能发布的各类规则、附件、声明、说明或指引等构成。<br />
            (二)不可抗力：包括信息网络设备维护、信息网络连接故障、电脑、通讯或其他系统的故障、电力故障、天气原因、意外事故、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争或其他合作方原因、数字资产市场崩溃、政府行为、司法或行政机关的命令、其他不在平台可控范围内或平台无能力控制的情形。<br />
            (三)关联公司：与其他公司之间存在直接或间接控制关系或重大影响关系的公司；<br />
            (四)知识产权：应当具有本协议第八十九条之意义。<br />
            第二条在该协议中引用的任何法典或者成文法令或者行政规章应当引用其最新的修订版本，无论该修订是在本协议签订之前或者之后做出。<br />
            第三条本协议中任何条款之标题的应用是出于简便的考量，而不应当用于解释协议条款之用途。引用任何陈述，条款，附件，表格是指该协议项下之陈述，条款，附件，表格。<br />
            第四条该协议项下，除非协议中另有要求，在任何情形下使用"包括"一词，应当具有"包括但不限于"之意义。<br />
            第五条除非本协议条款另有约定，本协议项下的各个文件相互冲突或者不一致，应当以下述顺序来决定文件的效力以解决冲突或者不一致：<br />
            (一)MinerGlory用户服务协议；<br />
            (二)MinerGlory隐私条款；<br />
            (三)MinerGlory反洗钱和反恐怖融资指引；<br />
            (四)其他协议、规则和指引。<br />
            第六条用户可以选择使用平台的不同语言版本，若存在平台的不同语言版本之内容不一致或者相冲突，或遗漏内容之情形，平台的中文文本应当优先适用。<br />
          </view>
          <view class="sub-title">第二章 平台基本条款</view>
          <view class="sub-content">
            第七条平台系信息中介服务平台（网址：www.minerglory.cn，如平台以公告等形式发布新的网址，请届时访问新的网址），平台服务是由本公司通过平台及客户端等各种方式向会员提供的服务，具体服务内容主要包括：数字资产交易信息发布、数字资产交易管理服务、用户服务等交易辅助服务，具体详情平台实际提供的服务内容为准。<br />
            第八条为了保障您的权益，您在自愿注册使用平台服务前，必须仔细阅读并充分理解知悉本服务协议所有条款。一经注册或使用平台服务即视为对本协议和平台对本协议随时做出的任何修改的充分理解和接受；如有违反而导致任何法律后果，您将自己独立承担相应的法律责任。<br />
            第九条在本协议履行过程中，平台可根据情况对本协议进行修改。一旦本协议的内容发生变动，平台将公布最新的服务协议，不再向会员作个别通知。如果会员不同意平台对本协议所做的修改，会员有权停止使用平台服务。如果会员继续使用平台服务，则视为会员接受平台对本协议所做的修改，并应遵照修改后的协议执行。<br />
            第十条平台对于会员的通知及任何其他的协议、告示或其他关于会员使用会员账户及服务的通知，会员同意平台可通过平台公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人
            （如以邮寄方式向会员发出通知的，则在该等通知按照会员在平台留存的联系地址交邮后的第三个自然日即视为送达）。因不可归责于平台的原因（包括电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致会员未在前述通知视为送达之日收到该等通知的，平台不承担任何责任。<br />
          </view>
          <view class="sub-title">第三章 注册会员</view>
          <view class="sub-content">
            第十一条在使用平台服务前，用户必须先在平台上进行注册。<br />
            第十二条注册平台个人会员的用户应当是年满十八岁或根据其所在国法律规定具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人<br />
            第十三条欲注册机构会员的法人、组织或其他机构，应当指定年满十八岁或根据其所在国法律规定具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人代表机构完成平台注册。<br />
            第十四条您一旦点击同意注册按钮，即表示您或您有权代理的机构同意本协议的全部内容，且您本人或您所代理的机构受到本协议之约束。若您不具备本协议第十二条或第十三条所要求之主体资格，则您及您有权代理的机构应承担因此而导致的一切后果，且平台保留注销或永久冻结您账户，并向您及您有权代理机构追究责任的权利。<br />
            第十五条您同意根据平台用户注册页面的要求提供姓名、电子邮箱、手机号码、国籍，身份证件等信息。<br />
            第十六条在注册前或者注册后，平台有权根据用户所在国家或地区的法律法规、规则、命令等规范的要求，向用户要求提供更多的信息或资料等。用户应当配合平台提交相关信息或资料，并采取合理的措施以符合当地的规范之要求。<br />
            第十七条会员在此承诺以下事项：<br />
            (一)出于合法交易自身数字资产之目的注册及使用本平台，且不具有以平台为媒介违反法律法规或破坏数字资产交易秩序之意图；<br />
            (二)会员必须依平台要求提示提供真实、最新、有效及完整的资料；<br />
            (三)会员保证并承诺通过平台进行交易的数字资产及资金来源合法；<br />
            (四)会员有义务维持并更新会员的资料，确保其为真实、最新、有效及完整；<br />
            (五)个人会员不为美国之居民，机构会员不为美国注册之公司；<br />
            (六)除本协议以外，会员应同时遵守平台不时发布及更新的全部规则，包括公告、产品流程说明、平台项目说明、风险提示等。<br />
            第十八条除非用户提交的信息是明显虚假，错误和不完整的，平台有权信赖用户所提供的信息。<br />
            第十九条若用户违背本协议第十七之承诺：<br />
            (一)平台有权包括停用会员平台帐户、拒绝会员使用平台服务的部份或全部功能。在此情况下，平台不承担任何责任，并且会员同意负担因此所产生的直接或间接的任何支出或损失；<br />
            (二)未及时更新基本资料，导致平台服务无法提供或提供时发生任何错误，会员不得将此作为取消交易或拒绝付款的理由，平台亦不承担任何责任，所有后果应由会员承担；<br />
            (三)会员应当承担因违背承诺而产生的任何直接或间接损失及不利后果，扣取不当获利，且平台保留追究会员责任的权利。<br />
            第二十条在您合法、完整并有效提供注册所需信息并经验证后，注册流程即告结束，用户正式成为平台会员，且可在平台进行会员登陆。<br />
            第二十一条会员通过平台购买或出售算力或数字资产应当符合以下要求：<br />
            (一)会员应当确保会员对其在交易页面上发布拟出售的数字资产或拟购买需支付的价款享有相应的权利，会员不得在交易页面上发布与数字资产之销售或购买无关的信息；<br />
            (二)会员应当确保其销售或购买数字资产以及发布交易信息等行为符合其所在主权国家或地区相关法律法规及本协议之要求，符合社会公序良俗，并其不侵犯任何第三方主体的合法权益；<br />
            (三)会员应当保证其填写的收款账户或付款账户为会员本人所有，因会员填写非本人的收款账户或付款账户而导致的损失和一切法律后果由会员本人承担；<br />
            (四)会员应当维护交易平台市场良性竞争秩序，不得贬低、诋毁竞争对手，不得干扰本网站上进行的任何交易活动，不得以任何不正当方式提升或试图提升自身的信用度，不得以任何方式干扰或试图干扰平台的正常运作；<br />
            (五)会员应当遵守诚实信用原则，确保会员所发布的交易信息合法合规、真实有效，并在交易过程中切实履行您的交易承诺；<br />
            (六)会员应当按其所在国家或地区法律法规的规定纳税。<br />
            第二十二条平台发现用户不适合进行高风险投资情形时，有权终止会员之投资行为或终止会员对会员账户之使用。<br />
            第二十三条无论本协议其他条款如何规定，平台对用户是否能够通过平台用户认证，以及是否注销已认证用户之资格具有自由裁量权。平台有权拒绝或注销任何用户的注册，且没有义务告知用户拒绝注册之理由，平台不承担任何因平台拒绝用户注册而导致用户所遭受的直接或间接的损失，且保留追究用户责任的权利。<br />
            第二十四条用户系自愿注册成为平台会员，平台没有强迫、诱导、欺骗或者通过其他不公平的手段对用户施加影响。<br />
          </view>
          <view class="sub-title">第四章 注册平台服务的内容</view>
          <view class="sub-content">
            第二十五条平台对完成注册的会员提供以下服务：<br />
            (一)提供数字资产各项目方所公开的相关信息；<br />
            (二)数字资产各项目的实时行情及交易信息；<br />
            (三)数字资产交易管理服务；<br />
            (四)提供客户服务；<br />
            (五)保障平台正常运营的技术和管理服务；<br />
            (六)平台公示的其他服务。<br />
            第二十六条平台接受数字资产项目方的委托依据本协议第二十五条进行信息发布，为数字资产之间的交易提供撮合服务，平台仅对数字资产项目方发布的信息承担文本审查责任，不对信息的准确、完整、合法性做出保证，也不承担相关责任，会员应依其独立判断做出决策。会员据此进行数字资产交易的，产生的风险由会员自行承担，会员无权据此向平台提出任何法律主张。会员与数字资产项目方之间因交易发生的或与交易有关的任何纠纷，应由纠纷各方自行解决，平台不承担任何交易风险及法律责任。<br />
            第二十七条本协议第二十五条所述之数字资产交易管理服务应当包括以下内容：<br />
            (一)会员账户：会员在平台进行注册时将生成会员账户，会员账户将记载会员在平台的活动，上述会员账户是会员登陆平台的唯一账户。<br />
            (二)数字资产交易：会员可以通过平台提交数字资产交易指令，用会员账户中的数字资产交易其他数字资产。<br />
            (三)法币和数字资产交易撮合服务：会员可以通过平台提交法币交易指令，购买平台中超算服务器、超算算力或数字货币销售方的数字资产。<br />
            (四)充币和提币：会员可以将数字货币等数字资产从其他地址转入会员账户指定地址，或将会员账户中的数字货币等数字资产转出至其他地址。<br />
            (五)交易状态更新：会员确认，会员在平台上按平台服务流程所确认的数字资产交易状态，将成为平台为会员进行相关交易或操作的不可撤销的指令。会员同意相关指令的执行时间以平台在平台系统中进行实际操作的时间为准。会员同意平台有权依据本协议及/或平台相关纠纷处理规则等约定对相关事项进行处理。会员未能及时对交易状态进行修改、确认或未能提交相关申请所引起的任何纠纷或损失由会员自行负责，平台不承担任何责任。<br />
            (六)交易指令传递：平台依据会员输入交易指令的时间和数据传递交易指令。会员了解平台系数字资产交易的撮合方，并不是买家或卖家参与买卖数字资产交易行为本身，且平台不提供任何国家法定货币的充入或提取业务。<br />
            (七)交易查询：平台将对会员在平台的所有操作进行记录，不论该操作之目的最终是否实现。会员可以通过会员账户实时查询会员账户名下的交易记录。<br />
            (八)交易安全设置：平台有权基于交易安全等方面的考虑不时设定涉及交易的相关事项，包括交易限额、交易次数等，会员了解平台的前述设定可能会对交易造成一定不便，对此没有异议。<br />
            (九)系统故障处理：如果平台发现了因系统故障或其他任何原因导致的处理错误，无论有利于平台还是有利于会员，平台都有权纠正该错误。如果该错误导致会员实际收到的数字资产多于应获得的数字资产，则无论错误的性质和原因为何，平台保留纠正不当执行的交易的权利，会员应根据平台向会员发出的有关纠正错误的通知的具体要求返还多收的数字资产或进行其他操作。会员理解并同意，平台不承担因前述处理错误而导致的任何损失或责任。<br />
            第二十八条除了本协议第二十五条项下所列之服务，和平台公示的技术性服务，平台不能就数字资产交易提供给会员任何投资、法律、税收或其他专业意见，且任何平台所提供之任何消息、探讨、分析、价格等信息均为一般评论，不构成对会员进行任何数字资产交易的建议。如果会员需要专业意见，会员应当向相关专业人事咨询数字货币交易有关的投资、法律、税收或其他专业性建议。平台不承担会员因依赖上述一般评论而产生的任何直接或间接而产生的损失（包括任何利润损失）。<br />
            第二十九条平台提供的服务不应当理解为或被用于向任何认定平台所提供之服务为非法的国家或地区的用户发出要约。<br />
            第三十条会员使用本平台进行数字资产交易的过程中应当遵守以下交易规则：<br />
            (一)浏览交易信息：会员在平台浏览交易信息时，应当仔细阅读交易信息中包含的全部内容，包括价格、委托量、手续费、买入或卖出方向，会员应当在完全理解并接受交易信息中的全部内容后，再点击按钮进行交易。<br />
            (二)委托之提交：在理解并完全接收交易信息中的全部内容后，会员可以输入数字资产交易信息，确认该信息无误后提交交易委托。一旦会员提交交易委托，则会员授权平台代理会员依据会员输入的数字资产交易信息进行相应的交易撮合。会员知悉并同意，当有满足会员委托交易价格的数字资产交易时，平台应当自动完成交易之撮合，且无需提前通知会员。<br />
            (三)交易明细之查询：会员可以通过个人账户直中的交易明细中查看相应的数字资产交易成交记录。<br />
            (四)撤销或修改委托：会员知悉，在委托之数字资产交易撮合未完成之前，会员有权随时撤销或修改委托。<br />
            第三十一条会员通过本平台使用法币购买卖方数字资产交易的过程中应当遵守以下交易规则：<br />
            (一)浏览交易信息：会员在平台浏览交易信息时，应当仔细阅读交易信息中包含的全部内容，包括价格、购买量、手续费、购买方式、购买限额等。<br />
            (二)买单和卖单的创建：通过平台提供的法币交易页面，会员创建了买单或者卖单，或者接受了其他用户的买单或卖单，则代表该会员同意并接受买单或卖单上显示的价格或数量；一旦会员创建或者接受，则交易价格被锁定，买方或卖方均无法在此次交易中更改或添加任何额外费用。<br />
            (三)涉交易数字资产代管：在整个法币交易过程中，交易订单涉及的数字资产将由平台代管，直到卖方确认收到全额付款并在法币平台上确认收款操作为止。<br />
            (四)支付价款：会员应当按照卖方在法币交易平台向您提供的有效的付款细节完成付款。会员了解，付款方式是会员和交易方之间所约定的第三方支付方式，包括但不限于网银转账、支付宝、微信转账等，平台不会和价款有任何形式的接触，对于所支付的价款也不存在任何形式的控制。因此，因付款，付款方式，或付款渠道而产生的或与其相关的一切交易纠纷与本平台无关，平台将不承担任何形式的责任。<br />
            (五)信息之理解和交易对手的确认：会员应当在完全理解并接受交易信息中的全部内容后再进行交易，并在达成交易前核实会员或交易对手的账户信息、收付款账户等信息。<br />
            第三十二条平台有权基于下述原因修改、暂停或永久停止对会员开放的平台之部分或全部服务：<br />
            (一)依据会员所属主权国家或地区的法律法规、规则、命令等规范的要求；<br />
            (二)平台出于保护平台或客户利益之合法利益；<br />
            (三)数字资产交易规则发生变更；<br />
            (四)其他合理理由。<br />
            第三十三条平台基于本协议第三十二条修改、暂停或永久停止对会员开放的平台之部分或全部服务的，生效日以平台公告为准。<br />
          </view>
          <view class="sub-title">第五章 账户安全及管理</view>
          <view class="sub-content">
            第三十四条会员了解并同意，确保会员账户及密码的机密安全是会员的责任。会员将对利用该会员账户及密码所进行的一切行动及言论，负完全的责任，并同意以下事项：<br />
            (一)会员应根据平台的相关规则以及平台的相关提示创建密码（密码包括但不限于登陆密码、资金密码、注册账户时绑定的手机号码以及手机接收的手机验证码、谷歌验证等，具体形式可能发生变化，下同），应避免选择过于明显的单词或日期，比如会员的姓名、昵称或者生日等；<br />
            (二)会员不对其他任何人泄露账户或密码，亦不可使用其他任何人的账户或密码。因黑客、病毒或会员的保管疏忽等非平台原因导致会员的会员账户遭他人非法使用的，平台不承担任何责任；<br />
            (三)会员禁止在未经平台同意的情形下不得将平台账号以赠与、借用、租用、转让或以其他方式处分给第三方；<br />
            (四)平台通过会员的会员账户及密码来识别会员的指令，会员确认，使用会员账户和密码登陆后在平台的一切行为均代表会员本人。会员账户操作所产生的电子信息记录均为会员行为的有效凭据，并由会员本人承担由此产生的全部责任；<br />
            (五)在平台通知会员可能预见的安全风险后，采取措施保障会员账号和密码安全；<br />
            (六)冒用他人账户及密码的，平台及其合法授权主体保留追究实际使用人连带责任的权利；<br />
            第三十五条会员如发现有第三人冒用或盗用该会员账户及密码，或其他任何未经合法授权的情形，应立即以有效方式通知平台，要求平台暂停相关服务，否则由此产生的一切责任由会员本人承担。同时，会员理解平台对会员的请求采取行动需要合理期限，在此之前，平台对第三人使用该服务所导致的损失不承担任何责任。<br />
            第三十六条平台有权基于单方独立判断，在其认为可能发生危害交易安全等情形时，不经通知而先行暂停、中断或终止向会员提供本协议项下的全部或部分会员服务（包括收费服务），移除或删除注册资料，扣押不当获利，且无需对会员或任何第三方承担任何责任。前述情形包括：<br />
            (一)平台认为会员提供的资料不具有真实性、有效性或完整性，包括盗用他人证件信息注册、认证信息不匹配等；<br />
            (二)平台发现异常交易或有疑义或有违法之虞时；<br />
            (三)平台认为会员账户涉嫌洗钱、套现、传销、被冒用或其他平台认为有风险之情形；<br />
            (四)平台发现会员使用非法或不正当的技术手段进行危害交易安全或影响公平交易的行为，包括篡改交易数据、窃取客户信息、窃取交易数据、通过平台攻击其他已注册账户等；<br />
            (五)平台认为会员已经违反本协议中规定的各类规则及精神；<br />
            (六)会员账户已连续一年内未登录或实际使用且账户中数字资产为零；<br />
            (七)会员违反本协议的其他情形。<br />
            (八)平台基于交易安全等原因，根据其单独判断需先行暂停、中断或终止向会员提供本协议项下的全部或部分会员服务（包括收费服务），并将注册资料移除或删除的其他情形。<br />
            第三十七条会员决定不再使用会员账户时，应首先清偿所有应付款项（包括服务费、管理费等），再将会员账户中的可用数字资产（如有）在可提取范围全部提取，并向平台申请冻结该会员账户，经平台审核同意后可正式注销会员账户。<br />
            第三十八条会员同意，如其会员账户未完成身份认证且已经连续一年未登陆，平台无需进行事先通知即有权终止提供会员账户服务，并可能立即暂停、关闭或删除会员账户及该会员账户中所有相关资料及档案。<br />
            第三十九条会员同意，会员账户的暂停、中断或终止不代表会员责任的终止，会员仍应对使用平台服务期间的行为承担可能的违约或损害赔偿责任，同时平台仍可保有会员的相关信息。<br />
            第四十条会员在交易平台上的任何行为扰乱或将扰乱交易平台正常交易秩序的，平台基于维护法币交易平台交易秩序及交易安全的需要，有权采取关闭相关交易订单、限制账户使用等措施以维护法币交易秩序。<br />
          </view>
          <view class="sub-title">第六章 会员的保证及承诺</view>
          <view class="sub-content">
            第四十一条会员承诺绝不为任何非法目的或以任何非法方式使用平台服务，并承诺遵守其所在国的相关法律、法规及一切使用互联网之国际惯例，遵守所有与平台服务有关的网络协议、规则和程序。<br />
            第四十二条会员同意并保证不得利用平台服务从事侵害他人权益或违法之行为，若有违反者应负所有法律责任。
            上述行为包括：<br />
            (一)冒用他人名义使用平台服务；<br />
            (二)从事任何不法交易行为，如贩卖枪支、毒品、禁药、盗版软件或其他违禁物；<br />
            (三)提供赌博资讯或以任何方式引诱他人参与赌博；<br />
            (四)涉嫌洗钱、套现或进行传销活动的；<br />
            (五)从事任何可能含有电脑病毒或是可能侵害平台服务系統、资料等行为；<br />
            (六)利用平台服务系统进行可能对互联网或移动网正常运转造成不利影响之行为；<br />
            (七)恶意干扰数字资产交易正常进行，破坏数字资产交易秩序；<br />
            (八)利用任何技术手段或其他方式干扰平台正常运行或干扰其他用户对平台服务的使用；<br />
            (九)以虚构、夸大事实等方式恶意诋毁平台商誉；<br />
            (十)其他平台有正当理由认为不适当之行为。<br />
            第四十三条平台保有依其单独判断删除平台内各类不符合法律政策或不真实或不适当的信息内容而无须通知会员的权利，并无需承担任何责任。若会员未遵守以上规定的，平台有权做出独立判断并采取暂停或关闭会员账户等措施，而无需承担任何责任。<br />
            第四十四条会员同意，由于会员违反本协议，或违反通过援引并入本协议并成为本协议一部分的文件，或由于会员使用平台服务违反了任何法律或第三方的权利而造成任何第三方进行或发起的任何补偿申请或要求（包括律师费用），会员会对平台及其关联方、合作伙伴、董事以及雇员给予全额补偿并使之不受损害。<br />
            第四十五条会员承诺，其通过平台上传或发布的信息均真实有效，其向平台提交的任何资料均真实、有效、完整、详细、准确。如因违背上述承诺，造成平台或平台其他使用方损失的，会员将承担相应责任。<br />
            第四十六条会员理解并同意，平台向符合条件的会员提供服务。平台对在平台上进行的数字资产投资或交易行为不承担任何责任，平台无法也没有义务保证会员投资成功，会员因投资或交易数字资产原因导致的损失由会员自行承担，平台不承担责任。<br />
            第四十七条会员同意对其平台注册账号下发生的所有活动（包括信息披露、发布信息、点击同意各类协议、上传提交各类文件、点击同意续签各类协议或点击同意数字货币交易等）承担责任，且如在上述活动进程中，若会员未遵从本协议条款或平台公布的交易规则中的操作指示的，平台不承担任何责任。<br />
            第四十八条会员同意，平台有权在提供平台服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息（包括在平台的任何页面上投放广告），并且，会员同意接受平台通过电子邮件或其他方式向会员发送商业促销或其他相关商业信息。<br />
            第四十九条会员同意，若会员因数字资产交易与项目方或其他第三方产生纠纷的，不得通过司法或行政以外的途径要求平台提供相关资料。<br />
          </view>
          <view class="sub-title">第七章 服务中断或故障</view>
          <view class="sub-content">
            第五十条会员同意，基于互联网的特殊性，平台不担保服务不会中断，也不担保服务的及时性和/或安全性。系统因相关状况无法正常运作，使会员无法使用任何平台服务或使用任何平台服务时受到任何影响时，平台对会员或第三方不负任何责任，前述状况包括：<br />
            (一)平台系统停机维护期间。<br />
            (二)电信设备出现故障不能进行数据传输的。<br />
            (三)由于黑客攻击、网络供应商技术调整或故障、网站升级的问题等原因而造成的平台服务中断或延迟。<br />
            (四)因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成平台系统障碍不能执行业务的。<br />
          </view>
          <view class="sub-title">第八章 责任范围及限制</view>
          <view class="sub-content">
            第五十一条平台未对任何平台服务提供任何形式的保证，包括以下事项：<br />
            (一)平台服务将符合会员的需求。<br />
            (二)平台服务将不受干扰、及时提供或免于出错。<br />
            (三)会员经由平台服务购买或取得之任何产品、服务、资讯或其他资料将符合会员的期望。<br />
            (四)平台包含的全部信息、程序、文本、数据等完全安全，不受任何病毒、木马等恶意程序的干扰和破坏。<br />
            (五)所有的交易结果计算都经过平台核实，相应的计算方法都会在平台上进行公示，但是平台不能保证其计算没有误差或不受干扰。<br />
            第五十二条会员知悉并同意，在任何情形下，平台不会就下列任一事项承担责任：<br />
            (一)用户的收入损失；<br />
            (二)用户的交易利润或合同损失；<br />
            (三)服务中断、中止或终止而引起的损失；<br />
            (四)预期可节省交易成本的损失；<br />
            (五)信息传递问题而造成的损失；<br />
            (六)措施投资或交易机会的损失；<br />
            (七)商誉或声誉的损失；<br />
            (八)数据的遗失或损坏而造成的损失；<br />
            (九)购买替代产品或服务的开销；<br />
            (十)任何由于侵权（包括故意和过失）、违约、或其他任何原因导致的间接的、特殊的或附带性的损失，不论此种损失是否为平台所能合理预见，亦不论平台是否事先被告知存在此种损失的可能性。<br />
            第五十三条会员了解并同意，发生以下任一情形时，平台有权拒绝赔偿会员的全部或部分损失：<br />
            (一)平台有合理的理由认为会员在平台的行为系涉嫌违法或不道德行为。<br />
            (二)会员误以为系平台原因造成损失的情形；<br />
            (三)任何非因平台原因引起的其他损失。<br />
            第五十四条平台服务的合作单位所提供的服务品质及内容由该合作单位自行负责。平台的内容可能涉及由第三方所有、控制或者运营的其他网站（以下简称"第三方网站"）。平台不能保证也没有义务保证第三方网站上任何信息的真实性和有效性。会员确认按照第三方网站的服务协议使用第三方网站，而不是按照本协议。第三方网站不是平台推荐或者介绍的，第三方网站的内容、产品、广告和其他任何信息均由会员自行判断并承担风险，而与平台无关。会员经由平台服务的使用下载或取得任何资料，应由会员自行考量且自负风险，因资料的下载而导致的任何损坏由会员自行承担。<br />
            第五十五条会员自平台及平台工作人员或经由平台服务取得的建议或资讯，无论其为书面或口头，均不构成平台对平台服务的任何保证。<br />
            第五十六条平台不保证为向会员提供便利而设置的外部链接的准确性、有效性、安全性和完整性，同时，对于该等外部链接指向的不由平台实际控制的任何网页上的内容，平台不承担任何责任。<br />
            第五十七条在法律允许的情况下，平台对于与本协议有关或由本协议引起的，或者，由于使用平台、或由于其所包含的或以其他方式通过平台提供给会员的全部信息、内容、材料、产品（包括软件）和服务、或购买和使用产品引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使其事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除平台对上述损失的责任。<br />
            第五十八条除本协议另有规定外，在任何情况下，平台对本协议所承担的违约赔偿责任总额不超过向会员收取的当笔数字资产交易平台服务费用总额。<br />
            第五十九条除本协议另有规定外，在任何情况下，因会员违反本协议或其所在国法律法规而导致平台遭受损失的，会员应当赔偿平台所遭受的一切直接和/或间接的损失（包括诉讼费用等）。<br />
            第六十条平台和会员均承认普通法对违约或可能违约情况的救济措施可能不足以弥补守约方遭受的全部或部分损失，故双方同意，协议一方有权在协议另一方违约或可能违约情况下寻求禁令救济以及普通法或衡平法允许的其他所有的补救措施。<br />
            第六十一条平台在本协议中做出的保证和承诺是平台就其依据本协议提供服务的唯一保证和陈述（以下简称"协议保证"），取代任何其他途径和方式产生的保证和承诺（以下简称"非协议保证"），无论非协议保证是以书面或口头，明示或暗示的形式做出。所有协议保证仅仅由平台做出，对平台自身具有约束力，其效力不能约束任何第三方。<br />
            第六十二条会员知悉并同意，平台并不放弃本协议中未提及的，在法律适用的最大范围内平台所享有的限制、免除或抵销平台损害赔偿责任的任何权利。<br />
          </view>
          <view class="sub-title">第九章 风险提示</view>
          <view class="sub-content">
            第六十三条会员了解并认可，任何通过平台进行的交易并不能避免以下风险的产生，平台不能也没有义务为如下风险负责：<br />
            (一)宏观经济风险：因宏观经济形势变化，可能引起价格等方面的异常波动，会员有可能遭受损失；<br />
            (二)政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，会员有可能遭受损失；<br />
            (三)违约风险：因项目方无力或无意愿进行或者继续进行项目开发，而导致的会员有可能遭受损失；<br />
            (四)收益风险：数字资产本身不由任何金融机构或平台发行，数字资产市场是全新的、未经确认的，且可能不会带来实际收益增长的市场；<br />
            (五)操盘风险：数字资产主要由投机者大量使用，零售和商业市场使用相对较少，数字资产交易存在极高风险，其全天不间断交易，没有涨跌限制，价格容易受庄家、全球政府政策的影响而大幅波动；<br />
            (六)不可抗力因素导致的风险；<br />
            (七)会员过错：因会员的过错导致的任何损失，包括：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、会员使用的计算机系统被第三方侵入、会员委托第三人代理交易时第三人恶意或不当操作而造成的损失。<br />
            第六十四条数字资产交易风险较高，并不适合普通人士投资。会员知悉并了解此投资有可能导致部分损失或全部损失，所以会员应当以能承受的损失程度来决定其投资或交易的数量。除了本协议第六十三条提示的风险外，还会有未能预测的风险存在。会员应慎重评估自己的财政状况，及各项风险，而做出任何数字资产投资或交易的决定。会员应当承担由该决定产生的全部损失，平台对会员的投资或交易决定不承担任何责任。<br />
            第六十五条鉴于数字资产投资或交易所衍生的风险，若用户对该种投资或交易由任何疑问，应当在交易或投资前事先寻求专业顾问的协助。<br />
            第六十六条平台不对任何会员及/或任何交易提供任何担保或条件，无论是明示、默示或法定的。平台不能也不试图对会员或项目方发布的信息进行控制，对该等信息，平台不承担任何形式的证明、鉴定服务。平台不能完全保证平台内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。会员应依赖于会员的独立判断进行交易，会员应对其做出的判断承担全部责任。<br />
            第六十七条平台对于会员使用平台服务不做任何明示或暗示的保证，包括但不限于平台提供服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，平台也不对平台提供的服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性做出任何承诺和保证。<br />
            第六十八条是否登陆或使用平台提供的服务是会员个人的决定且自行承担风险及可能产生的损失。平台对于数字资产的市场、价值及价格等不做任何明示或暗示的保证，会员知悉并了解数字资产市场的不稳定性，数字资产的价格和价值随时会大幅波动或崩盘，交易数字资产是会员个人的自由选择及决定，且自行承担风险及可能产生的损失。<br />
            第六十九条以上并不能揭示会员通过平台进行交易的全部风险及市场的全部情形。会员在做出交易决策前，应全面了解相关数字资产，根据自身的交易目标、风险承受能力和资产状况等谨慎决策，并自行承担全部风险。<br />
            第七十条在任何情况下，对于会员使用平台服务过程中涉及由第三方提供相关服务的责任由该第三方承担，平台不承担该等责任。<br />
            第七十一条因会员自身的原因导致的任何损失或责任，由会员自行负责，平台不承担责任。平台不承担责任的情形包括：<br />
            (一)会员未按照本协议或平台不时公布的任何规则进行操作导致的任何损失或责任；<br />
            (二)因会员向平台发送的指令信息不明确、或存在歧义、不完整等导致的任何损失或责任；<br />
            (三)会员账户内数字资产余额不足导致的任何损失或责任；<br />
            (四)其他因会员原因导致的任何损失或责任。<br />
          </view>
          <view class="sub-title">第十章 服务费用及其他费用</view>
          <view class="sub-content">
            第七十二条当会员使用平台服务时，平台向会员收取相关平台服务费用。各项平台服务费用详见会员使用平台服务时，平台上所列之收费说明及收费标准。平台保留单方面制定及调整平台服务费用收费标准的权利。<br />
            第七十三条会员在使用平台服务过程中可能需要向第三方支付一定的第三方服务费用，具体收费标准详见第三方网站相关页面，或平台的提示及收费标准。会员同意将根据上述收费标准自行或委托平台或平台指定的第三方代为向第三方支付该等服务费。<br />
          </view>
          <view class="sub-title">第十一章 协议之终止</view>
          <view class="sub-content">
            第七十四条会员有权在任何时候依据本协议条款之规定向平台申请注销平台账号，依据本协议第三十七条注销账号的，自平台批准用户注销账号之日起协议终止。<br />
            第七十五条依据本协议第三十六条、三十八条注销账号的，自平台注销用户账号之日起协议终止。<br />
            第七十六条会员死亡或被宣告死亡的，其在本协议项下的各项权利义务由其继承人承担。若会员丧失全部或部分民事权利能力或民事行为能力，平台或其授权的主体有权根据有效法律文书（包括生效的法院判决等）或其法定监护人的指示处置与会员账户相关的款项。若继承人或法定监护人决定继续履行本协议的，则本协议依然有效；反之，则继承人或法定监护人需要依据本协议第三十七条向平台申请注销账号，自平台批准用户注销账号之日起协议终止。<br />
            第七十七条平台有权依据本协议约定终止平台全部服务，本协议于平台全部服务终止之日终止，清退流程根据平台公告的具体规定进行操作。<br />
            第七十八条本协议终止后，会员无权要求平台继续向其提供任何服务或履行任何其他义务，包括但不限于要求平台为会员保留或向会员披露其原本网站账号中的任何信息，
            向会员或第三方转发任何其未曾阅读或发送过的信息等。<br />
            第七十九条本协议的终止不影响守约方向违约方主张其他协议终止前违约方之违约责任，也不影响本协议规定之后合同义务之履行。<br />
          </view>
          <view class="sub-title">第十二章 个人信息之保护和授权条款</view>
          <view class="sub-content">
            第八十条本协议第十二章中之个人信息应当包括以下信息：<br />
            (一)在用户注册平台账号或者使用账户时，用户根据本平台要求提供的个人注册信息，包括但不限于电话号码、邮箱信息、身份证件信息；<br />
            (二)在用户使用平台时，或访问平台时，平台自动接收并记录的用户浏览器上的服务器数值，包括但不限于IP地址等数据及用户要求取用的网页记录；<br />
            (三)平台收集到的用户在平台进行交易的有关数据，包括但不限于交易记录；<br />
            (四)平台通过合法途径取得的其他用户个人信息。<br />
            第八十一条不需要用户额外的同意，用户在平台注册成功即视为用户同意平台收集并使用或披露其个人信息，且用户了解并同意，基于为用户度身订造平台服务、解决争议并有助确保在平台进行安全交易的考量，平台可以将收集的用户个人信息用作下列用途包括：<br />
            (一)向用户提供平台服务；<br />
            (二)基于主权国家或地区相关主管部门的要求向相关部门进行报告；<br />
            (三)在用户使用平台服务时，平台将用户的信息用于身份验证、客户服务、安全防范、诈骗监测、市场推广、存档和备份用途，或与第三方合作推广网站等合法用途，确保平台向用户提供的产品和服务的安全性；<br />
            (四)帮助平台设计新产品及服务，改善平台现有服务目的而进行的信息收集和整理；<br />
            (五)为了使用户了解平台服务的具体情况，用户同意平台向其发送营销活动通知、商业性电子信息以及提供与用户相关的广告以替代普遍投放的广告；<br />
            (六)平台为完成合并、分立、收购或资产转让而将用户的信息转移或披露给任何非关联的第三方；<br />
            (七)软件认证或管理软件升级；<br />
            (八)邀请用户参与有关平台服务的调查；<br />
            (九)用于和政府机关、公共事务机构、协会等合作的数据分析；<br />
            (十)用于解决争议或对纠纷进行调停；<br />
            (十一)用作其他一切合法目的以及经用户授权的其他用途。<br />
            第八十二条平台按照用户在平台上的行为自动追踪关于用户的某些资料。在不透露用户的隐私资料的前提下，平台有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。<br />
            第八十三条用户同意，平台可在平台的某些网页上使用诸如"Cookies"的资料收集装置。<br />
            第八十四条平台根据相关法律法规以保护用户的资料。用户因履行本协议提供给平台的信息，平台不会恶意出售或免费共享给任何第三方，以下情况除外：<br />
            (一)提供独立服务且仅要求服务相关的必要信息的供应商；<br />
            (二)具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构；<br />
            (三)平台的关联公司；<br />
            (四)经平台使用方或平台使用方授权代表同意的第三方。<br />
            第八十五条用户授权平台，除法律另有规定之外，将用户提供给平台的信息、享受平台服务产生的信息（包括本协议签署之前提供和产生的信息）以及平台根据本条约定查询、收集的信息，用于平台及其因服务必要委托的合作伙伴为用户提供服务、推荐产品、开展市场调查与信息数据分析。<br />
            第八十六条授权平台，除法律另有规定之外，基于为用户提供更优质服务和产品的目的，向平台因服务必要开展合作的伙伴提供、查询、收集用户的信息。<br />
            第八十七条为确保用户信息的安全，平台及其合作伙伴对上述信息负有保密义务，并采取各种措施保证信息安全。<br />
            第八十八条本协议第十二章项下之条款自本协议签署时生效，具有独立法律效力，不受合同成立与否及效力状态变化的影响。<br />
          </view>
          <view class="sub-title">第十三章 知识产权的保护</view>
          <view class="sub-content">
            第八十九条平台上所有内容，包括著作、图片、档案、资讯、资料、平台架构、平台画面的安排、平台设计，文字和图表，软件编译，相关源代码和软件等均由平台或其他权利人依法拥有其知识产权，包括商标权、专利权、著作权、商业秘密等。<br />
            第九十条非经平台或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表平台程序或内容。<br />
            第九十一条用户未经平台的明确书面同意不许下载（除了页面缓存）或修改平台或其任何部分。用户不得对平台或其内容进行转售或商业利用；不得收集和利用产品目录、说明和价格；不得对平台或其内容进行任何衍生利用；不得为其他商业利益而下载或拷贝账户信息或使用任何数据采集、Robots或类似的数据收集和摘录工具。未经平台的书面许可，严禁对平台的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录（无论是否通过Robots、Spiders、自动仪器或手工操作）。另外，严禁为任何未经本使用条件明确允许的目的而使用平台上的内容和材料。<br />
            第九十二条未经平台明确书面同意，不得以任何商业目的对平台网站或其任何部分进行复制、复印、仿造、出售、转售、访问、或以其他方式加以利用。未经平台明确书面同意，用户不得用任何技巧把平台或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）据为己有。未经平台明确书面同意，用户不得以Meta
            Tags或任何其他"隐藏文本"方式使用平台或其关联公司的名字和商标。任何未经授权的使用都会终止平台所授予的允许或许可。<br />
            第九十三条用户登陆平台或使用平台提供的任何服务均不视为平台向用户转让任何知识产权。尊重知识产权是用户应尽的义务，如有违反，用户应对平台承担损害赔偿等法律责任。<br />
          </view>
          <view class="sub-title">第十四章 一般条款</view>
          <view class="sub-content">
            第九十四条本协议是由用户与平台共同签订的，适用于用户在平台的全部活动。本协议内容包括协议正文条款及已经发布的或将来可能发布的各类规则，所有条款和规则为协议不可分割的一部分，与本协议具有同等法律效力。<br />
            第九十五条如本协议中的任何条款被任何有管辖权的机构认定为不可执行的，无效的或非法的，并不影响本协议的其余条款的效力。<br />
            第九十六条本协议中约定的权利及义务同样约束通过转让从该权利义务中获取到利益的各方的受让人，继承人，遗嘱执行人和管理员。会员不得在我们不同意的前提下将本协议项下的权利或义务转让给任何第三方，但平台可随时将我们在本协议中的权利和义务转让给任何第三方，并于转让之日提前三十（30）天给与用户通知。<br />
            第九十七条如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，并可被尽可能接近各方意图的、能够保留本协议要求的经济目的的、有效的新条款所取代，而且，在此情况下，本协议的其他条款仍然完全有效并具有约束力。<br />
            第九十八条除非本协议中的其他条款另有约定，本协议中的任何规定均不应当被认为创造了、暗示了或以其他方式将平台视为会员的代理人、受托人或其他代表人。<br />
            第九十九条本协议任何一方未能就单一事件行使与本协议有关的权利或寻求救济，并不影响该缔约方随后就该单一事件或者在其他事件后行使该权利或者寻求救济。<br />
            第百条对违约行为的豁免，或本协议任一条款的放弃，仅在守约方或非寻求放弃方书面签字同意豁免后方能生效。任何该协议项下的违约豁免，不能认定或解释为守约方对其后再次违约或其他违约行为的豁免；未行使任何权利或救济不得以任何方式被解释为对该等权利或救济的放弃。<br />
            第百一条本协议依据维尔京群岛法律订立，其成立、解释、内容及执行均适用维尔京群岛相关法律规定；任何因本协议引起或与本协议相关的索赔或诉讼，都应当由维尔京群岛的法律进行解释和执行。<br />
            第百二条除非本协议项下其他规则另有约定，双方同意，由开曼仲裁中心对任何由本协议引起或与本协议相关的索赔或诉讼进行仲裁。<br />
            第百三条本协议自用户获得本网站账号时生效，对协议双方具有约束力。<br />
            第百四条本协议的最终解释权归平台所有。
          </view>
        </view>
        <view class="popup-btns">
          <u-button type="primary" @click="popup1Visible = false" shape="circle" style="width:100%;margin-top:32rpx;">关闭</u-button>
        </view>
      </scroll-view>
    </u-popup>
    <u-popup v-model="popup2Visible" mode="center" border-radius="16" :mask-close-able="true">
      <scroll-view  scroll-y class="pop-box">
        <view class="title">《MinerGlory隐私条款》</view>
        <view class="content">
          <view class="sub-title">第一条 制定的目的和依据</view>
          <view class="sub-content">
            为了向用户更好的提供该服务，平台需要在您登陆平台、进行平台注册和/或使用平台服务时采集您的信息，MinerGlory为预防对采集信息的滥用，根据《MinerGlory用户服务协议》等公司规定，制定本规则，就如何使用和保护采集信息进行明确规定。
          </view>
          <view class="sub-title">第二条 称谓表述</view>
          <view class="sub-content">
            为了本协议表述之方便，本平台在本协议中合称使用"我们"或其他第一人称称呼；访问平台的自然人或其它主体均称为"您"或其他第二人称；我们和您在本协议中合称为"双方"，我们或您称为"一方"。
          </view>
          <view class="sub-title">第三条 定义和解释</view>
          <view class="sub-content">
            在本协议中，除非本协议项下条款另有约定，以下词汇或者表述应当具有下述意义:<br />
            (一)个人信息：指电子或者其它方式记录的能够单独或者与其它信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括但不限于个人敏感信息；<br />
            (二)个人敏感信息：包括但不限于身份证件号码、用于识别身份的其它证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息等；<br />
            (三)个人信息删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不被检索、访问的状态。
          </view>
          <view class="sub-title">第四条 适用范围</view>
          <view class="sub-content">
            本协议适用于在MinerGlory及其APP（以下简称"平台"）交易的所有用户。用户应当遵循其所在国家或地区个人信息和数据保护方面的法律规定，在用户所在地区法律规定的范围内，执行本协议至规定。
          </view>
          <view class="sub-title">第五条 法条援引</view>
          <view class="sub-content">
            在本协议中引用的任何法典或者成文法令或者行政规章应当引用其最新的修订版本，无论该修订是在本协议签订之前或者之后做出。
          </view>
          <view class="sub-title">第六条 条款标题</view>
          <view class="sub-content">
            本协议中任何条款之标题的应用是出于简便的考量，而不应当用于解释协议条款之用途。引用任何陈述，条款，附件，表格是指本协议项下之陈述，条款，附件，表格。
          </view>
          <view class="sub-title">第七条 包括一词指使用</view>
          <view class="sub-content">
            本协议项下，除非协议中另有要求，在任何情形下使用"包括"一词，应当具有"包括但不限于"之意义。
          </view>
          <view class="sub-title">第八条 用户之同意和授权</view>
          <view class="sub-content">
            用户了解，一旦登陆平台，无论用户是否在平台上完成注册，该登陆用户即向我们表明其接受、同意、承诺和确认：<br />
            (一)该用户在自愿情形下，同意向我们披露个人信息；<br />
            (二)该用户会遵守本协议的全部条款和限制；<br />
            (三)该用户同意并授权平台在该用户登陆平台、进行平台注册和/或使用平台服务时收集用户的个人信息；<br />
            (四)该用户同意本协议之所有条款，且同意接受日后平台对隐私政策的任何修改；<br />
            (五)用户同意我们的分公司、附属公司、雇员就用户可能会感兴趣的产品和服务与用户联络(
            除非用户已经表示不想收到该等讯息 )。<br />
          </view>
          <view class="sub-title">第九条 收集的信息</view>
          <view class="sub-content">
            用户同意平台使用cookies来追踪用户使用平台时的每一个动作，并收集和记录用户留下的所有信息，其中包括但不限于用户的IP地址，地理位置及其他资料。
          </view>
          <view class="sub-title">第十条 信息之提供</view>
          <view class="sub-content">
            若用户自愿使用平台提供之服务，用户需要依据《MinerGlory用户服务协议》第三章之要求，和《反洗钱和反恐怖融资指引》相应条款之要求，填写和/或提供以下两类信息：<br />
            (一)身份信息：该类信息可以帮助平台验证用户是否有资格注册为平台会员，包括但不限于用户的姓名或名称、居住地址、邮寄地址、用户所属国家或政府签发的具有证明该用户身份信息的不同种类的证书以及涉及到的证书号码，及所有其它可帮助平台验证用户身份的信息（以下合称为"身份信息"）；<br />
            (二)服务信息：该类信息帮助平台与用户联系并顺利为您提供服务，包括但不限于您的电话号码、传真号码、有效的电子邮件地址、邮寄地址以及您的借记卡信息和/或其它帐户信息（以下合
            称为"服务信息"）。
          </view>
          <view class="sub-title">第十一条 收集信息方式之改变</view>
          <view class="sub-content">
            第十一条在用户使用本网站或其提供的服务时，平台为了改进平台的使用功能，提升用户对使用平台服务及其安全性的体验，或根据法院或可适用法律法规或有管辖权的其它政府机构的命令，通过平台公示的专属于平台的邮箱或其它我们认为合规的方式收集更多的必要的个人信息。
          </view>
          <view class="sub-title">第十二条 第三方网站</view>
          <view class="sub-content">
            如果用户访问了在本网站上的第三方网站或合作的第三方的任何链接，该用户同意并遵守该第三方网单独和独立的隐私政策。用户了解，平台对第三方网站或合作方的内容及活动不承担任何责任
          </view>
          <view class="sub-title">第十三条 Cookie的安装</view>
          <view class="sub-content">
            当用户访问平台时, 平台通过cookies使用Google
            Stats去记录平台的业绩以及核对在线广告的效果。Cookie是发送到用户的浏览器上并在用户的电脑硬盘驱动器上存储的小量数据。只有当用户使用其电脑进入平台时，Cookie才能够被发送到用户的电脑硬盘上。
          </view>
          <view class="sub-title">第十四条 Cookie的作用</view>
          <view class="sub-content">
            Cookies常用于记录访问者浏览平台上的各个项目时的习惯以及偏好。Cookies所搜集的资料是不记名的集体统计数据，不包含有个人资料。Cookies不能用于取得您的硬盘上的数据、您的电邮地址、及您的私人数据，其可使平台或服务商系统识别到您的浏览器并捕捉和记忆信息。
          </view>
          <view class="sub-title">第十五条 禁止Cookie之使用</view>
          <view class="sub-content">
            大多数浏览器都预设为可以接受Cookies，用户可以选择将其浏览器设定为不接受Cookies，或一旦Cookies被安装就立即通知用户的模式。用户应当了解，若用户进行禁止Cookies的相关设定，
            用户或许不能启动或使用平台的某些功能。
          </view>
          <view class="sub-title">第十六条 信息使用用途</view>
          <view class="sub-content">
            平台为了以下目的或以下列方式使用平台收集的信息：<br />
            (一)通过平台向用户提供平台各项服务；<br />
            (二)当用户使用平台时，平台能够辨别及确认用户的身份；<br />
            (三)为了改善和提高平台服务质量（具体而言，根据平台收到的用户信息及反馈，帮助平台改善服务，进而平台可以更有效地对您的服务请求和支持需求做出回应）；<br />
            (四)统计平台使用量的数据和政府机关、事业单位等合作的数据分析；<br />
            (五)个性化用户体验（具体而言，用户的信息将帮助平台更好地为您的个性化需求作出回应）；<br />
            (六)交易处理（具体而言，个人信息，除了为完成用户所要求的交易之目的，未经您的同意不会以任何理由被出售、交换、转移，或提供给任何第三方公司）；<br />
            (七)定期发送电子邮件（具体而言，用户提供的电子邮件地址，将用于接收平台的新闻，更新，相关产品或服务的信息，和向用户发送公告和更新有关用户的订单）；<br />
            (八)满足MinerGlory用户服务协议规定的其它目的，和为了满足该等目的的所有合法途径。<br />
          </view>
          <view class="sub-title">第十七条 向第三方披露信息</view>
          <view class="sub-content">
            平台不会向其他方出售、交易或以其它方式转让个人信息或允许其他方从我方平台收集、使用信息，但不包括以下其他方和以下信息：平台的关联方、帮助平台经营平台网站、开展业务、或者向用户提供服务的受信任的第三方，只要这些相关方同意将这些信息保密；平台向上述相关方披露信息时，平台所披露的信息应当是适当的，是遵守法律、法规、规章制度的或来自于法院或他主管当局的命令、执行平台策略，正常运行平台所需要，关联方提供服务所需或保护平台或他人的权利、财产或安全的，且上述披露不会被相关方用于营销，广告或非约定之用途。
          </view>
          <view class="sub-title">第十八条 个人资料的保护</view>
          <view class="sub-content">
            第十八条平台实施妥善的实物、电子、管理及技术方面的措施来保护和保障用户个人资料的安全。平台尽力确保通过平台所收集的任何个人信息皆免于任何与我们无关的第三方的滋扰。平台采取的安全措施包括但不限于：<br />
            (一)实物措施：存有用户个人信息的记录会被存放在有锁的地方；<br />
            (二)电子措施：存有用户个人信息的电脑数据会被存放在受严格登入限制的电脑系统和存储媒体上；<br />
            (三)管理措施：只有经平台授权的职员才能接触到您的个人信息,
            这些职员需要遵守平台个人信息保密的内部守则；<br />
            (四)技术措施：可能采用如Secure Socket Layer
            Encryption这种加密技术来输送用户的个人信息；<br />
            (五)其它措施：平台网络服务器受到"防火墙"的保护。
          </view>
          <view class="sub-title">第十九条 漏洞之通报</view>
          <view class="sub-content">
            若用户知悉平台上有任何安全方面的漏洞，请立即通过服务邮箱联系平台，
            使平台可以尽快采取妥适的行动进行弥补和更正。
          </view>
          <view class="sub-title">第二十条 免责条款</view>
          <view class="sub-content">
            尽管实施了本协议所述之技术和保安的措施，平台无法保证资料在互联网上的输送绝对安全，因此平台对用户提供给平台个人信息的安全不提供任何保证，且平台对任何因未经授权而接触用户个人信息所发生的事件一槪不承担任何赔偿责任。
          </view>
          <view class="sub-title">第二十一条 本协议之修订</view>
          <view class="sub-content">
            第二十一条平台保留随时修改本协议的权利。平台通过更新和发布新版本的生效日期通告用户平台对隐私政策进行了修改，并突出修订处。用户了解，有时平台会发布通知告诉用户本协议已修订，但这不是平台的义务。用户应当定期查看本协议并关注其修订情况，如果用户不同意修订的内容，用户应当停止立即访问平台。当本协议的更新版本发布，用户持续访问平台的行为即显示和表明用户同意本协议更新的内容，并同意遵守本协议更新后的版本。
          </view>
          <view class="sub-title">第二十二条 与我们的沟通</view>
          <view class="sub-content">
            如果用户有任何要求和意见，用户可以通过电子邮件support@minerglory.com，这是属于平台与用户沟通的唯一有效和官方电子邮件。平台对用户未使用有效的联系方式的联系后，平台没有义务进行回应也不承担责任。
          </view>
          <view class="sub-title">第二十三条 公告的发布</view>
          <view class="sub-content">
            平台只通过平台上的有效的联系方式发布公告和信息或在平台张贴公告，平台对由于用户信任了未通过以上方式获得的信息而产生的任何损失不承担责任。
          </view>
        </view>
        <view class="popup-btns">
          <u-button type="primary" @click="popup2Visible = false" shape="circle" style="width:100%;margin-top:32rpx;">关闭</u-button>
        </view>
      </scroll-view>
    </u-popup>
  </view>
</template>

<script>
export default {
  data() {
    return {
      popup1Visible: false,
      popup2Visible: false
    }
  }
}
</script>

<style lang="scss" scoped>
.treaty-container {
  .treaty-tips {
    color: #7c8698;
    font-size: 24rpx;
    .link {
      color: #0091ff;
    }
  }
}
.pop-box {
  width: 80vw;
  max-width: 700rpx;
  padding: 40rpx 32rpx;
  max-height: 80vh;
  overflow-y: auto;
  background: #fff;
  border-radius: 16rpx;
  .title {
    font-size: 36rpx;
    margin-bottom: 32rpx;
    text-align: center;
    font-weight: bold;
  }
  .content {
    font-size: 24rpx;
    line-height: 36rpx;
    color: #7c8698;
    margin-bottom: 24rpx;
  }
  .sub-title {
    margin-bottom: 15rpx;
    font-weight: bold;
    font-size: 28rpx;
    color: #203152;
  }
  .sub-content {
    color: #7c8698;
    font-size: 24rpx;
    line-height: 36rpx;
    margin-bottom: 24rpx;
  }
  .popup-btns {
    margin-top: 32rpx;
    text-align: center;
  }
}
</style>
